artillery-test-fn.yml
config:
  target: "https://fn-scaling-stu-win.azurewebsites.net/api/HttpTrigger2"
  phases:
    - duration: 15
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "keywords.csv"
    fields:
      - "keyword"

scenarios:
  - name: "test fn"
    flow:
      - get:
          url: "/?{{ keyword }}"
      - think: 5